app/controllers/todos_controller.rb

  def all_todos
    todos = Todo.all.order(created_at: :asc)
---
SELECT "todos".* FROM "todos" ORDER BY "todos"."created_at" DESC

  def create
    title = params[:title]
    new_todo = Todo.create(title: title)
---
INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "test"], ["created_at", "2021-10-25 02:42:55.498615"], ["updated_at", "2021-10-25 02:42:55.498615"]]

  def update
    todo = Todo.find_by(id: params[:id])
    if todo
      todo.title = params[:title]
      todo.completed = params[:completed]
      todo.save
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "title" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["title", "testamsdasdasd"], ["updated_at", "2021-10-25 05:15:11.716537"], ["id", 26]]

  def delete
    todo = Todo.find_by(id: params[:id])
    if todo
      todo.destroy
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 1]]